{"id":2140,"date":"2018-12-22T03:46:12","date_gmt":"2018-12-22T03:46:12","guid":{"rendered":"https:\/\/gadgetronix.net\/your-one-stop-guide-to-solar-energy-in-tanzania\/"},"modified":"2023-11-17T17:36:38","modified_gmt":"2023-11-17T17:36:38","slug":"your-one-stop-guide-to-solar-energy-in-tanzania","status":"publish","type":"post","link":"https:\/\/gadgetronix.net\/your-one-stop-guide-to-solar-energy-in-tanzania\/","title":{"rendered":"Your One-Stop Guide to Solar Energy in Tanzania"},"content":{"rendered":"<h2 class=\"wp-block-heading\">What is Solar Energy?<\/h2><p class=\"p3\"><span class=\"s1\">Solar energy is simply energy provided by the sun. With the use of technology, man is able to harness the sun&#8217;s energy and make it usable to power different equipment(s). <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar energy is an important source of <a href=\"https:\/\/en.wikipedia.org\/wiki\/Renewable_energy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\"><span class=\"s2\">renewable energy<\/span><\/a>. The amount of solar energy reaching the surface of the earth in one year is estimated to be twice as much as will ever be obtained from all of the Earth&#8217;s non-renewable resources of coal, oil, natural gas, and mined uranium combined.<\/span><\/p><h2 class=\"wp-block-heading\">Uses of Solar Energy<\/h2><p class=\"p3\"><span class=\"s1\">Solar thermal technologies can be used for water heating, space heating\/cooling, cooking, and water treatment, among other thermal uses. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar energy is also used in the production of <span class=\"s2\">solar electricity<\/span> and is anticipated to become the world&#8217;s largest source of electricity by 2050. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar energy plays a part in the revolution of <span class=\"s2\">architecture and urban planning<\/span>, modern buildings are designed to maximize light and warmth. <\/span><\/p><p class=\"p3\"><span class=\"s1\">In <span class=\"s2\">agriculture and horticulture<\/span>, techniques such as timed planting cycles, tailored row orientation, staggered heights between rows, and the mixing of plant varieties are used to optimize the capture of sunlight. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar energy has influenced the manufacturing of solar-powered modes of <a href=\"https:\/\/www.greenmatch.co.uk\/blog\/2015\/01\/solar-energy-in-transportation\" target=\"_blank\" rel=\"nofollow noreferrer noopener\"><span class=\"s2\">transportation<\/span><\/a> such as boats, planes, and balloons. A good example would be vehicles currently used in the <a href=\"https:\/\/en.wikipedia.org\/wiki\/World_Solar_Challenge\" target=\"_blank\" rel=\"nofollow noreferrer noopener\"><span class=\"s2\">World Solar Challenge<\/span><\/a>.<br><\/span><\/p><h2 class=\"wp-block-heading\">Benefits of Solar Energy<\/h2><h3 class=\"wp-block-heading\">1- Saves Cost<\/h3><p class=\"p3\"><span class=\"s1\">Once a solar system is installed, one is expected to recover the cost of installing the solar energy system in about 10 years. Saving can be from saving in electricity bills or as in some countries, solar rebates which are offered by Governments. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar energy systems also require very little maintenance to ensure that they are in working order hence saving on maintenance costs and the hassle of organizing repairs. One thing you need to note is that you should go for the<a href=\"https:\/\/gadgetronix.net\/product-category\/solar-panels\/\"> best solar panels in Tanzania<\/a>. Low-quality versions could cost you more. <\/span><\/p><h3 class=\"wp-block-heading\">2- Protects the Environment<\/h3><p class=\"p3\"><span class=\"s1\">Solar energy production has zero noise and emission. It is the most environmentally friendly form of energy. <\/span><span class=\"s1\">Other types of fuels such as coal, oil, and gasoline are the leading causes of increased carbon dioxide in the atmosphere. <span class=\"s2\">Effects of increased carbon dioxide<\/span> include global warming and ocean acidification.<\/span><\/p><p class=\"p3\"><span class=\"s1\">In low-income countries, charcoal and firewood are the major sources of fuel which leads to deforestation. Solar energy is a sustainable alternative for such communities by providing them with an alternative for their household fuel needs. <\/span><\/p><h3 class=\"wp-block-heading\">3- Offers Energy Security<\/h3><p class=\"p3\"><span class=\"s1\">Solar energy is a stable source of electricity. Once you have a solar system set up, you will no longer be affected by power cut-outs. All you need is a <a href=\"https:\/\/gadgetronix.net\">good solar panel in Tanzania<\/a> coupled with a solar generator. A rise in utility charges will also not be one of your worries.<\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar power is not only sustainable, but it is also renewable. This means that once you install a solar system, you will never run out of energy because, well, the sun never runs out. All you need to do is <a href=\"https:\/\/gadgetronix.net\">hire a company that understands how to install a solar system<\/a><\/span><\/p><p class=\"p6\"><span class=\"s4\">According to National Geographic, <span class=\"s5\"><b>Every hour the sun beams<\/b> more <b>energy<\/b> onto Earth than it needs to satisfy global <b>energy needs<\/b> for an <b>entire year<\/b><\/span>.<\/span><\/p><h3 class=\"wp-block-heading\">4- Improve your property value<\/h3><p class=\"p3\"><span class=\"s1\">Since the world is recognizing the value of solar energy, a home built with a solar energy system is much more valuable than a traditionally powered home. By having a solar energy system set up, should you need to move, your house will fetch a higher price in the market than it normally would prior to installing a solar energy system. <\/span><\/p><p class=\"p3\"><span class=\"s1\">The world is also seeing a shift in the tourism industry where properties that are solar-powered, especially in third-world countries where the power supply is not stable, are preferred by most travelers. Travelers especially those in favor of sustainable tourism, opt for solar-powered properties because of their stable power while leaving no carbon footprints. <\/span><\/p><figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/gadgetronix.net\/wp-content\/uploads\/2022\/10\/Basic-solar-power-system.png\" alt=\"\" class=\"wp-image-2748\" title=\"\"><\/figure><h2 class=\"wp-block-heading\">How do Solar Systems work to Produce Electricity?<\/h2><p class=\"p3\"><span class=\"s1\">Solar<\/span> energy production begins when sunlight comes into contact with a solar panel. Sunlight is a form of energy consisting of invisible particles called photons, that have energy, but zero rest mass. Solar panels collect photons and pass the photons through silicon cells to free up the electrons contained therein and eventually processed them <span class=\"s1\">to form electricity.<\/span><\/p><p class=\"p3\"><span class=\"s1\">The energy generated by a solar panel comes in a form of <a href=\"https:\/\/en.wikipedia.org\/wiki\/Direct_current\" target=\"_blank\" rel=\"nofollow noreferrer noopener\"><span class=\"s2\">Direct Current<\/span><\/a> (DC). The DC current needs to be converted through an inverter to produce <a href=\"https:\/\/en.wikipedia.org\/wiki\/Alternating_current\" target=\"_blank\" rel=\"nofollow noreferrer noopener\"><span class=\"s2\">Alternating Current<\/span><\/a> (AC) energy which is the form of energy commonly used in homes and businesses. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Since solar energy depends on the sun being<\/span> out, a solar storage system will come in handy to ensure that you have the energy to use even when the sun is out such as at night<span class=\"s1\"> or on cloudy days. <\/span><\/p><h2 class=\"wp-block-heading\">The basic components of a Solar System<\/h2><h3 class=\"wp-block-heading\">A.Solar Panels<\/h3><p class=\"p3\"><span class=\"s1\">In order to have a solar electrical system, you need something to capture the sunlight. You need a solar panel. Solar panels are the most important part of the solar energy system. Without a panel, you are not able to collect sunlight which is the key ingredient in the production of solar energy.<\/span><\/p><p class=\"p3\"><span class=\"s1\">For the system to work properly, the entire solar panel must be exposed to sunlight. This is why you need to make sure you engage with <a href=\"https:\/\/gadgetronix.net\/about\/\">a company that has experience in installing solar panels and solar generators in Tanzania<\/a>. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar panels are made of an array of <a rel=\"nofollow noreferrer noopener\" href=\"https:\/\/en.wikipedia.org\/wiki\/Photovoltaics\" target=\"_blank\"><span class=\"s2\">photovoltaic<\/span><\/a>(PV) cells that are made of semiconductors. The majority<\/span> of <span class=\"s1\">solar panels use crystalline silicon cells. The PV cells collect and convert sunlight into energy before sending the energy to an inverter ready to be converted into electricity. <\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>Types of Solar Panels<\/b><\/span><\/h2><h3 class=\"wp-block-heading\"><em><span class=\"s6\"><span class=\"s1\">i. <\/span>Monocrystalline Silicon PV (mono-silicon or single silicon)<\/span><\/em><\/h3><p class=\"p3\"><span class=\"s1\">These are commonly used for residential and commercial installations for both large and smaller-scale systems. Their cells use very pure silicon and have a complicated crystal growth process.<\/span><\/p><p class=\"p3\"><span class=\"s1\">They are the most efficient type of photovoltaic cell (14-19% efficiency level), but also the most expensive due to their high silicon content and take more energy to use.<\/span><\/p><h3 class=\"wp-block-heading\"><em><span class=\"s1\">ii. Polycrystalline Silicon PV (multi-crystalline, multi-silicon, ribbon)<\/span><\/em><\/h3><p class=\"p3\"><span class=\"s1\">Polycrystalline silicon panels are also common for both residential and commercial installations. They are also produced from silicon but have slightly lower levels of efficiency (13-17% efficiency level) as compared to Monocrystalline Silicon PV. They have lower silicon levels hence they are less expensive.<\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>Installation of Solar Panels<\/b><\/span><\/h2><p class=\"p3\"><span class=\"s1\">Solar panels can be roof-mounted or ground-mounted. Ground-mounted roofs are an excellent option for high performance and accessibility, however, they require extra space in your yard for them to be installed. <\/span><\/p><p class=\"p3\"><span class=\"s1\">While roof-mounted panels remain hugely popular, certain factors need to be taken into consideration to make sure you have the right roof for your panels. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Below are a few of the top factors that determine your roof compatibility with solar panels. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>i. Orientation and Pitch:<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">This refers to the direction in which your solar panel faces. The direction of your roof may have a large impact on the productivity of your roof-mounted panel. Your solar panel will generate the most energy when it gets many hours of sunlight exposure in a day. <\/span><\/p><p class=\"p3\"><span class=\"s1\">The Pitch or slope of your roof influences the arrangement of your solar panels. A steeper roof makes the installation of your solar panels difficult while a flat roof requires additional racking to lift the panel to the right angle. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Contrary to common beliefs, solar panels on flat roofs are more flexible and less expensive systems than those mounted on the ground or pitched roof.<\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>ii. The Roof’s Age<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">It may be wise to replace your roof if it is quite old before installing a solar panel. Solar panels can last for up to 30 years and having to repair your roof in the next 5 years will result in costs that can otherwise be avoided. <\/span><\/p><p class=\"p3\"><span class=\"s1\">In order to repair your roof, your solar installation company will need to unmount and remount the solar panels, and often, this comes at a charge from your installation company. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>iii. Shading<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">To maximize the productivity of your solar panel, your roof should have minimal hours of shading so that your panels get enough direct sunlight. <\/span><\/p><p class=\"p3\"><span class=\"s1\">It may be time to trim a few branches off the surrounding trees to allow more sun to reach your panels. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>iv. Your Roof’s Material <\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">A strong roof is more suitable for solar panels to be able to hold the panel&#8217;s<\/span> weight. Metal roofs<span class=\"s1\"> and composite shingles are generally recommended for ease of solar installation. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Other roofing materials such as clay, slate, and wood shake shingles are highly breakable and most installers will shy away from working on these types of roofs. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>v. The size of your roof<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">The more roof space, the more panels you are able to install. Most residential solar panel systems are 5kW and hence require about 20 250-watt panels. That is at least 500 sq feet of roof space since each kW requires a space of at least 100 sq feet. <\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>How many panels do you need?<\/b><\/span><\/h2><p class=\"p3\"><span class=\"s1\">Most solar energy users have more than one solar panel. The number of panels needed, mostly depends on how much power is needed in your home or business, or as we have seen in the previous sections, your roof space, can also determine the maximum number of panels you can install. This is the same with ground mounting, the space you have in your yard will determine how many panels you can have installed. <\/span><\/p><p class=\"p3\"><span class=\"s1\">The first step in determining the number of panels is to find out how much power you currently use on an average day. A look at your electric bill can help you figure out your average daily power usage. Once you know your average power use per day, <a href=\"https:\/\/gadgetronix.net\/about\/\">speak to your solar consultant<\/a> to find out how many panels you will need based on your energy consumption. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Other factors such as the weather in your location play a part in determining the number of panels. Weather affects how much solar radiation reaches the ground. A cloudy day won’t be as productive as a sunny day.<\/span><\/p><p class=\"p3\"><span class=\"s1\">It can be difficult to come up with a straightforward answer. We’d advise you to <a href=\"https:\/\/gadgetronix.net\/contact\/\">contact us<\/a> so that we can survey your plot and provide you with expert recommendations. <\/span><\/p><p class=\"p3\"><span class=\"s1\"><b>How long will they last?<\/b><\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar panels generally have a life span of 25-30 years or more. This does not mean your panels will stop working altogether, it simply means their capacity will be reduced. Solar energy systems degrade at varying rates depending on the brand, as well as the climate where they’re installed.<\/span><\/p><p class=\"p3\"><span class=\"s1\">To make your panels last longer, keep your panels clear of damaging elements such as leaves, dirt, dust, bird droppings,<\/span> etc, which <span class=\"s1\">will allow your panels to produce optimal solar energy. Consult your solar provider if your panels are obstructed or damaged by any of these elements unless you have proper training and equipment to clean the panels. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Make sure your solar system receives regular maintenance and check-ups for maximum efficiency of your panel’s performance.<\/span><\/p><h3 class=\"wp-block-heading\">&nbsp;<\/h3><figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/gadgetronix.net\/wp-content\/uploads\/2022\/10\/IMG-20190213-WA0016-1024x576.jpg\" alt=\"\" class=\"wp-image-2749\" title=\"\"><\/figure><h3 class=\"wp-block-heading\">B. Batteries<\/h3><p class=\"p3\"><span class=\"s1\">Once the sunlight is converted into solar energy, you need something to store the energy. Batteries come in handy when the sun is not shining as they will provide you with a power supply from the batteries’ storage. <\/span><\/p><p class=\"p3\"><span class=\"s1\">There are batteries specially made for use in solar energy systems. These are recommended for solar power use due to their ability to repeatedly charge and discharge as you use energy.<\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>Types of Batteries used in Solar Power<\/b><\/span><\/h2><p class=\"p3\"><span class=\"s1\">There are three common types of batteries used in solar energy: <\/span><\/p><ul class=\"wp-block-list\"><li><span class=\"s6\">Lead-acid Batteries <\/span><\/li>\n\n<li><span class=\"s6\">Lithium-ion Batteries and <\/span><\/li>\n\n<li><span class=\"s6\">Flow Batteries. <\/span><\/li><\/ul><p class=\"p3\"><span class=\"s1\">Lead acid batteries have large capacities and have widely been used in renewable energy. They are relatively low-cost and a good option for people who want to solely depend on solar energy. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Lithium-ion batteries are a little more expensive than lead-acid batteries. They are ideal for those who want to use solar energy but still remain connected to the power grid. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Flow batteries are the latest option in solar batteries. They have a longer lifespan<\/span> but have complex chemistry which requires additional energy and cost, thus reducing their current popularity. It is, however, foreseen that the solar energy industry will be leaning toward this type of battery<span class=\"s1\"> in the future. <\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>How to Choose your Solar Storage<\/b><\/span><\/h2><p class=\"p3\"><span class=\"s1\">In choosing the battery for your solar energy storage, other than the price, of course, there are important factors to consider such as battery capacity &amp; power ratings, depth of discharge (DoD), round-trip efficiency, warranty, and manufacturer.<\/span><\/p><h3 class=\"wp-block-heading\"><b><span class=\"s1\">i. <\/span>Capacity &amp; power<\/b><\/h3><p class=\"p3\"><span class=\"s1\">Capacity is the total amount of electricity in kilowatt-hours (kWh) that a solar battery can store. Capacity alone is not a good indicator without considering a battery’s power. Power is the amount of electricity that a battery can deliver at a given time measured in kilowatts (kW). <\/span><\/p><p class=\"p3\"><span class=\"s1\">A battery can have a high capacity i.e store enough energy but have a low power i.e you are not able to run a lot of appliances at once. However, this will allow you to run the appliances for a longer period of time. <\/span><\/p><p class=\"p3\"><span class=\"s1\">To get extra capacity, you can stack up multiple batteries in your solar system storage since most batteries are designed to be stackable. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>ii. The depth of discharge (DoD)<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">Most solar batteries have an indication of how much you can use the battery&#8217;s power before you are required to recharge it. Due to their chemical makeup, solar batteries need to retain some amount of charge at all times.<\/span><\/p><p class=\"p3\"><span class=\"s1\">Using a solar battery beyond the indicated DoD will shorten the battery’s useful life. In choosing a battery, one with a higher DoD will allow you to utilize more of your battery’s capacity before recharging. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>iii. Round-trip efficiency<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">A battery’s round-trip efficiency is the percentage of the energy that can be used out of the amount of energy that went into the battery during charging. <\/span><\/p><p class=\"p3\"><span class=\"s1\">For example, if you fully charge your 5kWh battery but find out that you are only able to use 3kWh out of the 5 kWh, then your battery has a 60% round-trip efficiency.<\/span><\/p><p class=\"p3\"><span class=\"s1\">A battery with a higher round-trip efficiency will get you more usage value out of your battery. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>iv. Battery life &amp; warranty<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">A battery cycle occurs when you charge and drain the battery. The battery’s cycle time will gradually decrease over time. As the battery gets older, it will not be able to hold much of its charge as compared to when it was new. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Solar batteries normally have a warranty that guarantees a certain number of cycles and years of useful life. Some manufacturers may also guarantee that the battery will keep a certain amount of its capacity over the course of its warranty. <\/span><\/p><h3 class=\"wp-block-heading\"><span class=\"s1\"><b>v. Manufacturer<\/b><\/span><\/h3><p class=\"p3\"><span class=\"s1\">There is a wide range of battery manufacturers ranging from automotive companies with a long history of battery manufacturing entering the storage market to tech start-ups that boast new and high-performing technology.<\/span><\/p><p class=\"p3\"><span class=\"s1\">Your choice of a battery manufacturer will depend on your preference, whether to go for an old reliable brand that may not have the technical flare in their products or to go for a newer high-tech brand with innovative products. <\/span><\/p><p class=\"p3\"><span class=\"s1\">If it all gets confusing, a look at their warranties can help you make a decision on which manufacturer to go for. <\/span><\/p><p class=\"p3\"><span class=\"s1\">We also do offer solar generators as we have partnered with different vendors across the world to make sure that you get the best quality possible. <\/span><\/p><h3 class=\"wp-block-heading\">C. Charge Controller<\/h3><p class=\"p3\"><span class=\"s1\">The strength of sunlight is not fixed, it varies from time to time. On days when the sun is significantly stronger, there is the possibility that the voltage produced by the solar panels can damage the batteries. A charge controller is required to regulate the battery charging process to prevent damage to the batteries and increase the battery life. <\/span><\/p><h3 class=\"wp-block-heading\">D. Power Inverter<\/h3><p class=\"p3\"><span class=\"s1\">A power inverter can be used in two scenarios. When using a solar-powered source of energy, it is useful in converting the low voltage DC to 120 volts AC for use in homes and businesses. <\/span><\/p><p class=\"p3\"><span class=\"s1\">When you also use power from a utility grid or an AC generator, you will need an inverter to charge your batteries. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Your choice of an inverter will depend on whether you will be using it solely for solar energy use or you will need to use solar power together with grid power. <\/span><\/p><h3 class=\"wp-block-heading\">E. Solar Panel Mount<\/h3><p class=\"p3\"><span class=\"s1\">In order to install solar panels, you will need solar panel mounts to hold the weight of the panels. <\/span><\/p><p class=\"p3\"><span class=\"s1\">Roof-based solar panels are normally made of aluminum rails that <\/span>line up at calculated angles to achieve the most potential for<span class=\"s1\"> sunlight capture. Ground-based solar systems use ground mounts which are typically made of concrete. <\/span><\/p><h3 class=\"wp-block-heading\">F. Utility Meter<\/h3><p class=\"p3\"><span class=\"s1\">If you need to install a solar energy system but need to remain connected to the power grid, you will need a utility meter. The meter is used by power companies to measure and regulate the energy collected by your solar panels. <\/span><\/p><p class=\"p3\"><span class=\"s1\">As an experienced company in the solar energy space, we can assist you to <a href=\"https:\/\/gadgetronix.net\">install a solar system in your home or business<\/a>.   <\/span><\/p><h2 class=\"wp-block-heading\"><span class=\"s1\"><b>Did you know?<\/b><\/span><\/h2><p class=\"p3\"><span class=\"s1\">Solar energy has been used by mankind from as early as the 7th century B.C. While the use was not supported by technological equipment as we do in the modern day, still solar energy was used for heat, cooking, lighting, and to light fires. <\/span><\/p><p class=\"p3\"><span class=\"s1\">From the 7th Century B.C., ancient Greeks and Romans used magnifying glasses to concentrate the sun’s rays onto fuel and light a fire. In extreme cases, solar energy was used as a war tactic such as in the case of the Greek scientist <a rel=\"nofollow noreferrer noopener\" href=\"https:\/\/en.wikipedia.org\/wiki\/Archimedes\" target=\"_blank\"><span class=\"s2\">Archimedes<\/span><\/a> who experimented with using the reflectivity of bronze shields to focus sunlight and set fire to enemies’ wooden ships.<\/span><\/p><p class=\"p3\"><span class=\"s1\">While it has taken mankind close to 2,000 years to advance solar technology, it seems we have come upon a strong candidate for the future of energy in the world. <\/span><\/p>","protected":false},"excerpt":{"rendered":"<p>What is Solar Energy? Solar energy is simply energy provided by the sun. With the use of technology, man is [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":2144,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[8,1],"tags":[],"class_list":["post-2140","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-solar-energy-projects","category-uncategorized"],"acf":[],"_links":{"self":[{"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/posts\/2140","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/comments?post=2140"}],"version-history":[{"count":0,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/posts\/2140\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/media\/2144"}],"wp:attachment":[{"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/media?parent=2140"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/categories?post=2140"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/gadgetronix.net\/wp-json\/wp\/v2\/tags?post=2140"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}